{
  "personalDetails": {
    "firstName": "Bamdad",
    "preferredName": "Bam",
    "lastName": "Fard",
    "email": "hire@bamfard.info",
    "homeTown": "London",
    "country": "United Kingdom",
    "aboutMe": "Frontend developer with a foundation in React and TypeScript, passionate about collaborating within diverse teams to achieve shared goals. Currently expanding my skill set with Python and Tailwind, I thrive on the challenge of continuous learning. With a down-to-earth and iterative approach to problem-solving, I'm committed to delivering practical solutions that make a difference.",
    "other": "Outside of work, I am passionate about my hobbies and often engage in multiple projects simultaneously. In spring and summer, I relish fishing on lakesides. As colder seasons set in, I indulge in playing board games; recently, I've been running a Dungeons & Dragons campaign with colleagues at Smart. Additionally, you can find me rock-climbing whenever I get the chance, and occasionally, I've been known to strum the guitar."
  },
  "skillsAndTech": {
    "title": "Skills & Technologies",
    "values": [
      "JavaScript",
      "TypeScript",
      "Storybook",
      "React",
      "Unit testing",
      "End-to-end testing",
      "HTML/CSS",
      "Server Side Rendering",
      "Single Page Applications",
      "Node",
      "Browser APIs",
      "Git & Github",
      "SQL (MySQL, Postgres)",
      "Vite",
      "Remix",
      "Next",
      "Tailwind CSS",
      "Agile/Kanban/Scrum"
    ]
  },
  "employmentHistory": {
    "title": "Employment History",
    "jobs": [
      {
        "job": "React Developer",
        "company": "Smart Pension",
        "startDate": "2022-08",
        "endDate": "2024-02",
        "duties": [
          "Collaborated with product owners, designers, and testers to develop new features for Smart's web and mobile platforms.",
          "Created proof-of-concept features for user testing and incorporated feedback-driven enhancements.",
          "Aided in the transition of approved prototypes to production-ready code.",
          "Debugged production issues and optimized code in Smart's legacy systems.",
          "Improved test coverage and feature offerings for clients and users across multiple products.",
          "Acquired knowledge of pension law in diverse jurisdictions and customized features for users in UK, EU, and Middle East."
        ]
      },
      {
        "job": "Web Developer",
        "company": "AG Grid",
        "startDate": "2019-03",
        "endDate": "2022-08",
        "duties": [
          "Developed customized solutions using JavaScript, TypeScript, React, Vue, Angular, and other relevant technologies.",
          "Generated proof-of-concept examples to support Sales Team in acquiring new customers and facilitated new customer onboarding.",
          "Identified and documented bugs, enriched the company knowledge base, and crafted showcase projects for the company blog."
        ]
      },
      {
        "job": "Junior Developer",
        "company": "Cardonet Consultancy IT Support",
        "startDate": "2018-03",
        "endDate": "2019-03",
        "duties": [
          "Developed new features for the in-house CRM using PHP, HTML, CSS, JavaScript, and MySQL.",
          "Investigated and resolved issues, fixed bugs, and made enhancements independently.",
          "Collaborated with end-users iteratively to integrate customized features."
        ]
      }
    ]
  },
  "education": {
    "title": "Education",
    "values": [
      {
        "degreeType": "BSc",
        "subject": "Computer Science",
        "institution": "University of Hertfordshire",
        "grade": "2:1",
        "startDate": "2011-08",
        "endDate": "2015-06",
        "modules": [
          "Quantum Computing",
          "Artificial Intelligence",
          "Neural Networks"
        ],
        "comment": "My dissertation subject was about Artificial Intelligence & AI."
      },
      {
        "degreeType": "Ma",
        "subject": "Investigative Journalism",
        "institution": "City, University of London",
        "startDate": "2016-08",
        "endDate": "2017-07",
        "modules": [
          "Investigative Reporting",
          "Editorial and TV Production",
          "Data Journalism",
          "Media Law"
        ]
      }
    ]
  }
}
